<h1>DataFrames

In [162]:
import pandas as pd

In [163]:
data = {
    "state": ["Gto", "CDMX", "SLP"],
    "year": [2001, 2002, 2003],
    "pop": [1.5, 1.7, 3.6],
}

In [164]:
df = pd.DataFrame(data)
df

  state  year  pop
0   Gto  2001  1.5
1  CDMX  2002  1.7
2   SLP  2003  3.6

In [165]:
df1 = pd.DataFrame(data, columns=["pop", "year", "state"])
df1

   pop  year state
0  1.5  2001   Gto
1  1.7  2002  CDMX
2  3.6  2003   SLP

In [166]:
df2 = pd.DataFrame(
    data,
    columns=["year", "state", "pop", "deb"],
    index=["one", "two", "three"],
)
df2

       year state  pop  deb
one    2001   Gto  1.5  NaN
two    2002  CDMX  1.7  NaN
three  2003   SLP  3.6  NaN

In [167]:
df2.columns

Index(['year', 'state', 'pop', 'deb'], dtype='object')

In [168]:
df2.index

Index(['one', 'two', 'three'], dtype='object')

In [169]:
df2.values

array([[2001, 'Gto', 1.5, nan],
       [2002, 'CDMX', 1.7, nan],
       [2003, 'SLP', 3.6, nan]], dtype=object)

In [170]:
df2.describe()

         year       pop
count     3.0  3.000000
mean   2002.0  2.266667
std       1.0  1.159023
min    2001.0  1.500000
25%    2001.5  1.600000
50%    2002.0  1.700000
75%    2002.5  2.650000
max    2003.0  3.600000

In [171]:
df2.shape

(3, 4)

In [172]:
df2.head()

       year state  pop  deb
one    2001   Gto  1.5  NaN
two    2002  CDMX  1.7  NaN
three  2003   SLP  3.6  NaN

In [173]:
df2.tail(1)

       year state  pop  deb
three  2003   SLP  3.6  NaN

<label> Acceso a elementos

In [174]:
df2['state']

one       Gto
two      CDMX
three     SLP
Name: state, dtype: object

In [175]:
df2[["state"]]

      state
one     Gto
two    CDMX
three   SLP

In [176]:
df2.year

one      2001
two      2002
three    2003
Name: year, dtype: int64

In [177]:
df2[:2]

     year state  pop  deb
one  2001   Gto  1.5  NaN
two  2002  CDMX  1.7  NaN

In [178]:
df[1:2]

  state  year  pop
1  CDMX  2002  1.7

In [179]:
df2[2::]

       year state  pop  deb
three  2003   SLP  3.6  NaN

In [180]:
df[::1]

  state  year  pop
0   Gto  2001  1.5
1  CDMX  2002  1.7
2   SLP  2003  3.6

In [181]:
df[::-1]

  state  year  pop
2   SLP  2003  3.6
1  CDMX  2002  1.7
0   Gto  2001  1.5

<label>Configurar Indice

In [182]:
df3 = df2.set_index("state")

In [183]:
df3

       year  pop  deb
state
Gto    2001  1.5  NaN
CDMX   2002  1.7  NaN
SLP    2003  3.6  NaN

<label>regresar dataframe a su estado original

In [184]:
df3 = df2.reset_index()

In [185]:
df3

   index  year state  pop  deb
0    one  2001   Gto  1.5  NaN
1    two  2002  CDMX  1.7  NaN
2  three  2003   SLP  3.6  NaN

<label>buscar por indice

In [186]:
df3.loc[[0, 1]]

  index  year state  pop  deb
0   one  2001   Gto  1.5  NaN
1   two  2002  CDMX  1.7  NaN

In [187]:
df3.loc[[1]]

  index  year state  pop  deb
1   two  2002  CDMX  1.7  NaN

In [188]:
df3.loc[0:1]

  index  year state  pop  deb
0   one  2001   Gto  1.5  NaN
1   two  2002  CDMX  1.7  NaN

In [189]:
df3.loc[:, "pop"]

0    1.5
1    1.7
2    3.6
Name: pop, dtype: float64

In [190]:
df3.loc[1, :]

index     two
year     2002
state    CDMX
pop       1.7
deb       NaN
Name: 1, dtype: object

In [191]:
df3.iloc[:2]  # nos da hasta dos elementos

  index  year state  pop  deb
0   one  2001   Gto  1.5  NaN
1   two  2002  CDMX  1.7  NaN

In [192]:
df3.iloc[2, :]

index    three
year      2003
state      SLP
pop        3.6
deb        NaN
Name: 2, dtype: object

In [193]:
df3.iloc[1:2:]

  index  year state  pop  deb
1   two  2002  CDMX  1.7  NaN

In [194]:
df.iloc[1, :]

state    CDMX
year     2002
pop       1.7
Name: 1, dtype: object

In [195]:
df3.iat[0, 0]

'one'

In [196]:
df3.at[1, "pop"]

1.7

<label> eliminar columna

In [197]:
del df3["deb"]

In [198]:
df3

   index  year state  pop
0    one  2001   Gto  1.5
1    two  2002  CDMX  1.7
2  three  2003   SLP  3.6

## reindexando

In [199]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])

In [200]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [201]:
obj2 = obj.reindex(["a", "b", "c", "d"])

In [202]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [203]:
obj.reindex(["a", "b", "c", "d", "e"], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [204]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])

In [205]:
obj3.reindex(range(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [206]:
df3

   index  year state  pop
0    one  2001   Gto  1.5
1    two  2002  CDMX  1.7
2  three  2003   SLP  3.6

In [207]:
df3.drop([0])

   index  year state  pop
1    two  2002  CDMX  1.7
2  three  2003   SLP  3.6

In [208]:
df3.drop("index", axis=1)

   year state  pop
0  2001   Gto  1.5
1  2002  CDMX  1.7
2  2003   SLP  3.6

In [209]:
import numpy as np

df1 = pd.DataFrame(np.arange(12).reshape((3, 4)), columns=list("abcd"))
df2 = pd.DataFrame(np.arange(20).reshape((4, 5)), columns=list("abcde"))

In [210]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

### reyenar de valores

In [211]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [212]:
df1.reindex(columns=df2.columns, fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

In [213]:
obj = pd.Series(["a", "b", "c", "d", "a", "b", "c", "d"])

In [214]:
obj.unique()

array(['a', 'b', 'c', 'd'], dtype=object)

In [215]:
obj

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: object

In [216]:
obj.value_counts()

a    2
b    2
c    2
d    2
Name: count, dtype: int64

In [217]:
pd.value_counts(obj.values, sort=True)

C:\Users\lopez\AppData\Local\Temp\ipykernel_9756\442226650.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.values, sort=True)

a    2
b    2
c    2
d    2
Name: count, dtype: int64

In [218]:
mask = obj.isin({"b", "c"})
mask

0    False
1     True
2     True
3    False
4    False
5     True
6     True
7    False
dtype: bool

In [219]:
obj[mask]

1    b
2    c
5    b
6    c
dtype: object

In [220]:
obj[~obj.isin(["b", "c"])] # filtrar

0    a
3    d
4    a
7    d
dtype: object

In [221]:
string_data = pd.Series(["qwerty", "asdfg", np.nan, "aguacate"])

In [222]:
string_data[string_data.isnull()]

2    NaN
dtype: object

In [223]:
string_data[0] = None

In [224]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [225]:
string_data.dropna()

1       asdfg
3    aguacate
dtype: object

### valores no nulos

In [226]:
string_data[string_data.notnull()] # filtrado

1       asdfg
3    aguacate
dtype: object

In [227]:
string_data.dropna(how="all") # borra datos nulos

1       asdfg
3    aguacate
dtype: object

In [228]:
string_data.fillna('como')  ## llena valores NaN con 0

0        como
1       asdfg
2        como
3    aguacate
dtype: object

In [232]:
string_data = pd.Series(["qwerty", "asdfg", np.nan, "aguacate", np.nan])
string_data.fillna(method="ffill", limit=2)

C:\Users\lopez\AppData\Local\Temp\ipykernel_9756\4098605605.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  string_data.fillna(method="ffill", limit=2)

0      qwerty
1       asdfg
2       asdfg
3    aguacate
4    aguacate
dtype: object

In [230]:
string_data

0        None
1       asdfg
2         NaN
3    aguacate
dtype: object

In [234]:
numbre_data = pd.Series([np.nan, 1, 2, 3, 4])
numbre_data.fillna(numbre_data.mean())  ## rellenar valor nulo con la media

0    2.5
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64